{
  "title": "Watcho",
  "image": "/projects/aq/hero.jpg",
  "live": "https://watcho-movie-app.vercel.app/",
  "role": "Frontend Developer",
  "agency": "AQuest",
  "completed": "08.2024",
  "awards": [],
  "modules": [
    {
      "component": "TextIntro",
      "text": "Watcho è un'app per film ricca di funzionalità, costruita con React, JavaScript, HTML e CSS. Offre un'esperienza utente fluida con un sistema di raccomandazione, opzioni di ordinamento per popolarità, tendenze e ultime uscite. Gli utenti possono guardare i trailer su YouTube, navigare su IMDb per informazioni ufficiali e ricevere suggerimenti per film simili e stagioni disponibili, rendendola una piattaforma completa per gli appassionati di cinema."
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/reel-aq.mp4",
          "alt": "AQuest reel"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "The challenge",
      "text": "Durante lo sviluppo di Watcho, ho affrontato diverse sfide, tra cui la gestione efficiente dello stato complesso con React, specialmente per funzionalità dinamiche come l'ordinamento e le raccomandazioni. L'integrazione di API esterne per recuperare i dati dei film, i trailer da YouTube e i dettagli da IMDb ha richiesto una gestione attenta delle operazioni asincrone e degli errori. Garantire un'esperienza utente fluida durante la navigazione tra diverse funzionalità, come i suggerimenti per film simili e le stagioni, è stata anche una sfida significativa, richiedendo ottimizzazioni per prestazioni e reattività su diversi dispositivi.",
      "numbers": [
        {
          "value": "100+",
          "label": "Movie suggestions"
        },
        {
          "value": 1,
          "label": "Month of work"
        },
        {
          "value": "3+",
          "label": "Tech stack used"
        }
      ]
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/v1.mp4",
          "alt": "AQuest v1"
        },
        {
          "src": "/projects/aq/v2.mp4",
          "alt": "AQuest v2"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "The attention to detail",
      "text": "Tutte le pagine del sito dovevano avere la stessa attenzione ai dettagli, indipendentemente dalla frequenza con cui sarebbero state visitate.<br /><br /> L'attenzione ai dettagli si riflette anche nel processo di selezione dei film. Ad esempio, quando un utente seleziona un film, l'interfaccia passa senza problemi a mostrare non solo i dettagli del film, ma anche raccomandazioni simili e stagioni disponibili. Questa esperienza è arricchita da animazioni sottili e elementi di design coerenti, garantendo all'utente una sensazione di continuità e fluidità durante tutta l'interazione."
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/ropes.mp4",
          "alt": "AQuest v1"
        }
      ]
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/pong404.mp4",
          "alt": "AQuest v2"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "Not only creativity",
      "text": "Questo progetto non ha significato solo creatività dal punto di vista visivo, ma è stata anche un'opportunità per sperimentare nuovi strumenti di sviluppo.<br /><br /> L'intero codice del frontend è infatti scritto in React/JS.<br /><br />"
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/aquest-site.jpeg",
          "alt": "AQuest site"
        }
      ]
    }
  ]
}
